function letter() {
    var x = prompt("Введите либо аккорд, либо квинт:\n").toUpperCase();
    var ek = ("\n\nЭлектронная конфигурация - ");
if(x == "") {
        alert("\nПожалуйста, введите аккорд");
    }
if(x == "AM") {
        alert("Am - Минор\n\n1 лад вторая струна, 2 лад 3 и 4 струна");
    }
if(x == "A") {
        alert("A - Мажор\n\n2 лад, 2, 3 и 4 струна");
    }
if(x == "EM") {
        alert("Em - Минор\n\n2 лад, 4 и 5 струны");
    }
if(x == "E") {
        alert("E - Мажор\n\n1 лад 3 струна, 2 лад 4 и 5 струна");
    }
if(x == "C") {
        alert("C - Мажор\n\n1 лад вторая струна, 2 лад 4 струна, 3 лад 5 струна");
    }
if(x == "G") {
        alert("G - Мажор\n\n2 лад 5 струна, 3 лад 6, 2 и 1 струна");
    }
if(x == "D") {
        alert("D - Мажор\n\n2 лад, 1 и 3 струна, 3 лад, 2 струна");
    }
if(x == "FMAJ7") {
        alert("F - maj7\n\n1 лад, 2 струна, 2 лад 3 струна, 3 лад, 4 и 5 струна");
    }
if(x == "F") {
        alert("F - Мажор\n\n1 лад баррэ, 2 лад 3 струна, 3 лад 4 и 5 струна");
    }
if(x == "Bm") {
        alert("B - Минор\n\n1 лад баррэ, 2 лад 2 струна, 3 лад 3 и 4 струна");
    }
if(x == "Bm") {
        alert("B - Минор\n\n1 лад баррэ, 2 лад 2 струна, 3 лад 3 и 4 струна");
    }
if(x == "S") {
        alert("S - Стас\n\n1 лад баррэ, 2 лад баррэ, 3 лад 3 и 4 струна");
    }
if(x == "F#M") {
        alert("F# - Минор\n\n1 лад баррэ, 3 лад 4 и 5 струна");
    }
if(x == "СТАС") {
        alert("S - Стас\n\n1 лад баррэ, 2 лад баррэ, 3 лад 3 и 4 струна");
    }
if(x == "СТАСИК") {
        alert("S - Стас\n\n1 лад баррэ, 2 лад баррэ, 3 лад 3 и 4 струна");
    }
}